In [42]:
import numpy as np

In [43]:
import pandas as pd

In [44]:
data = {'Company':["Google","Google","MSFT","MSFT","FB","FB"],
       "person": ["Sam", "charlie","Amy","Venessa","Carl","Sarah"],
       "sales": [200,120,340,124,243,350]}

In [45]:
data

{'Company': ['Google', 'Google', 'MSFT', 'MSFT', 'FB', 'FB'],
 'person': ['Sam', 'charlie', 'Amy', 'Venessa', 'Carl', 'Sarah'],
 'sales': [200, 120, 340, 124, 243, 350]}

In [46]:
df = pd.DataFrame(data)

In [47]:
df

  Company   person  sales
0  Google      Sam    200
1  Google  charlie    120
2    MSFT      Amy    340
3    MSFT  Venessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [48]:
#for groupbying by company 
bycomp = df.groupby("Company")

In [49]:
bycomp
#We will get the following error
#<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000024A86030518>

In [50]:
#to correct it or make it a valuable , we have to take the mean or add or something like that

In [51]:
bycomp.mean() #here the second column(Name) is left out because pandas will automatically ignores strings

         sales
Company
FB       296.5
Google   160.0
MSFT     232.0

In [52]:
bycomp.sum() #we will get sum of each company

         sales
Company
FB         593
Google     320
MSFT       464

In [53]:
bycomp.std()

              sales
Company
FB        75.660426
Google    56.568542
MSFT     152.735065

In [54]:
bycomp.sum()

         sales
Company
FB         593
Google     320
MSFT       464

In [55]:
#if  i want only sum of one company for ex,FB , we can do it by loc or iloc method

In [56]:
bycomp.sum().loc["FB"] # by loc method

sales    593
Name: FB, dtype: int64

In [57]:
bycomp.sum().iloc[0] # by iloc method

sales    593
Name: FB, dtype: int64

#if we want all the above procedure in one line

In [58]:
df.groupby("Company").sum().loc["FB"] # all done in one step

sales    593
Name: FB, dtype: int64

In [59]:
df.groupby("Company").count() # counts how many types of them are there

         person  sales
Company
FB            2      2
Google        2      2
MSFT          2      2

In [60]:
df.groupby("Company").max() #max values of each company

          person  sales
Company
FB         Sarah    350
Google   charlie    200
MSFT     Venessa    340

In [61]:
df.groupby("Company").min() #min values of each company

        person  sales
Company
FB        Carl    243
Google     Sam    120
MSFT       Amy    124

In [62]:
# "describe" give bunch of informatin at a time

In [63]:
df.groupby("Company").describe()

        sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [65]:
df.groupby("Company").describe().transpose()

Company              FB      Google        MSFT
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [66]:
df.groupby("Company").describe().transpose()["FB"]

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64